[
    {
      "bookId": 1,
      "bookName": "The Lord of the Rings: The Fellowship of the Ring",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/DL2cwWX/The-loard-of-the-rings.jpg",
      "review": "The first part of an epic fantasy trilogy, The Fellowship of the Ring sets the stage for a grand adventure filled with richly developed characters, intricate world-building, and a timeless struggle against the forces of darkness. Tolkien's masterful storytelling immerses readers in the enchanting realm of Middle-earth, where the fate of the world hangs in the balance. With themes of friendship, courage, and the triumph of good over evil, this book captivates readers of all ages and continues to inspire generations.",
      "totalPage": 398,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["fantasy", "adventure"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1954
    },
    {
      "bookId": 2,
      "bookName": "Harry Potter and the Philosopher's Stone",
      "author": "J.K. Rowling",
      "image": "https://i.ibb.co/mS4cCmF/harry-potter.jpg",
      "review": "The inaugural installment of the beloved Harry Potter series introduces readers to the magical world of Hogwarts School of Witchcraft and Wizardry. Rowling's imaginative storytelling and vivid characters make for an enchanting reading experience as young Harry Potter discovers his identity as a wizard and embarks on a journey of self-discovery, friendship, and the battle against dark forces. Filled with wonder, humor, and themes of courage and resilience, this book continues to enchant readers worldwide.",
      "totalPage": 332,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["magic", "Hogwarts"],
      "publisher": "Bloomsbury",
      "yearOfPublishing": 1997
    },
    {
      "bookId": 3,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/d68MpKT/The-Catcher-in-the-Rye.png",
      "review": " A seminal coming-of-age novel, The Catcher in the Rye follows the introspective journey of Holden Caulfield, a disenchanted teenager grappling with the phoniness of the adult world. Salinger's poignant narrative captures the alienation and disillusionment of youth, offering a raw and honest portrayal of adolescence. Through Holden's voice, the novel explores themes of identity, alienation, and the search for authenticity, leaving a lasting impact on readers with its timeless portrayal of teenage angst",
      "totalPage": 224,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["coming-of-age", "youth"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 4,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/Gd9Khbf/Pride-and-Prejudice.jpg",
      "review": "Regarded as a classic of English literature, Pride and Prejudice is a captivating romance novel that transcends time with its wit, charm, and social commentary. Austen's keen observation of manners and society is on full display as she navigates the intricacies of love, pride, and social class through the spirited exchanges between Elizabeth Bennet and Mr. Darcy. With its enduring themes of love conquering prejudice and the pursuit of happiness, this novel continues to delight readers with its timeless appeal.",
      "totalPage": 279,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["romance", "love"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 5,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/Y79zzgR/The-Hobbit.jpg",
      "review": "The Hobbit is a charming and adventurous tale set in the enchanting world of Middle-earth. Tolkien's skillful storytelling transports readers on a journey with Bilbo Baggins, a hobbit who finds himself swept into an epic quest to reclaim treasure guarded by the dragon Smaug. Filled with memorable characters, thrilling escapades, and richly detailed landscapes, this book captivates readers of all ages with its sense of wonder and whimsy.",
      "totalPage": 310,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["adventure", "fantasy"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "bookId": 6,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/PzKzsMC/To-Kill-a-Mockingbird.jpg",
      "review": "A timeless classic of American literature, To Kill a Mockingbird is a poignant exploration of racial injustice, moral growth, and the loss of innocence in the Deep South. Through the eyes of young Scout Finch, Harper Lee paints a vivid portrait of a town grappling with prejudice and discrimination during the 1930s. With its unforgettable characters, powerful themes, and evocative prose, this novel continues to resonate with readers, challenging them to confront the complexities of race, empathy, and the pursuit of justice.",
      "totalPage": 281,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["classics","morality"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 7,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/PDXs65s/George-Orwell.jpg",
      "review": "A chilling dystopian masterpiece, 1984 remains a haunting portrayal of totalitarianism and the erosion of individual freedom. Orwell's vision of a surveillance state where truth is manipulated and dissent is punished is as relevant today as it was when it was first published. Through the eyes of Winston Smith, readers are drawn into a world of perpetual war, government surveillance, and the suppression of thought. With its prophetic warnings and timeless relevance, this novel serves as a stark reminder of the dangers of unchecked power and the importance of preserving freedom.",
      "totalPage": 328,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["dystopian", "surveillance"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 8,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/8PhYNXh/The-Great-Gatsby.jpg",
      "review": "A quintessential American novel, The Great Gatsby is a poignant exploration of the Jazz Age and the elusive pursuit of the American Dream. Set against the backdrop of 1920s New York, Fitzgerald's lyrical prose and vivid characters bring to life the glittering world of wealth, love, and excess. Through the enigmatic figure of Jay Gatsby, the novel delves into themes of illusion, identity, and the corrupting influence of money. With its timeless appeal and tragic beauty, this novel continues to captivate readers with its portrayal of the promise and disillusionment of the American Dream.",
      "totalPage": 180,
      "rating": 4.3,
      "category": "Fiction",
      "tags": [ "wealth", "love"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 9,
      "bookName": "The Da Vinci Code",
      "author": "Dan Brown",
      "image": "https://i.ibb.co/X4rRH5X/The-Da-Vinci-Code.jpg",
      "review": "A gripping thriller that blends art, religion, and conspiracy, 'The Da Vinci Code' takes readers on a pulse-pounding adventure across Europe as symbologist Robert Langdon unravels cryptic clues and unravels a centuries-old mystery. Dan Brown's fast-paced narrative and intricate plot twists keep readers on the edge of their seats, while his exploration of religious history and symbolism adds depth and intrigue to the story. With its blend of history, mystery, and suspense, this novel is a compelling page-turner that has captivated millions of readers worldwide.",
      "totalPage": 689,
      "rating": 4.2,
      "category": "Thriller",
      "tags": ["thriller", "religion"],
      "publisher": "Doubleday",
      "yearOfPublishing": 2003
    }
  ]


  






